/*******************************************************************************
* File: KS103Drive.h                                                               
* Description:
* 对KS103的操作.
*******************************************************************************/
#ifndef _KS103DRIVE_H_
#define _KS103DRIVE_H_
/******************************************************************************/
#include<typedefs.h>

/******************************************************************************/
/*Existing variables*/
extern u8 code SensorAddress[19];

/*******************************************************************************
* Constants
*******************************************************************************/
#define InitAddress 0xe8
#define CurrentAddr 0xee

#define ConnectTest 0xa0
#define DetectedCmd 0xb0

/*******************************************************************************
* Function Declarations
*******************************************************************************/

/*----------------------------------------------------------------------------*/
/* Public functions */
void sentCommand		(u8 u8addr, u8 u8cmd);	//向固定地址发送特定指令
void setAddress			(u8 addr1, u8 addr2);		//设定新地址
void activeSensor		(u8 u8addr);						//激活传感器
void setDetectedCmd	(u8 u8cmd);							//探测指令
void sensorInit			(void);									//扫描形成新的地址队列
void allocAddress		(void);									//地址自动分配
#endif